TradeDemoBase/src/Documents/Перемещине/Перемещине.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перемещине</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>СкладОткуда</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКуда</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TradeDemoBase/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

TradeDemoBase/src/Documents/Перемещине/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ОстаткиТоваров.Записывать = Истина;
    
    Для Каждого Строка Из СписокТоваров Цикл
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.Склад = СкладОткуда;
        Движение.Товар = Строка.Товар;
        Движение.Количество = Строка.Количество;
        
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Склад = СкладКуда;
        Движение.Товар = Строка.Товар;
        Движение.Количество = Строка.Количество;
    КонецЦикла;
КонецПроцедуры
